# 1
# n = {1 ,5,4,2,'a','b','c'}
# print(n)
# a = {'a','b','c'}
# print(a)
# b = {1,2,2,3,3,3,4,4,4,4}
# print(b)
# print(len(b))

# 2

# a = [1,42,'a','asd',5,6,7,3,3,3,3]
# print(len(a))
# c = set(a)
# print(len(c))
# v = list(c)
# print(v)

# 3
# st = []
# num = []
#
# a = {1, 42, 'a', 'asd', 5, 6, 7, 2, 2, 2}
# for i in a:
#     if type(i) is int:
#         num.append(i)
#     elif type(i) is str:
#         st.append(i)
# num.sort()
# st.sort(key=len)
# print(num, st)




# a = {1,42,'a','asd',5,6,7,3,3,3,3}
#
# for i in a:
#     print(i, end='')
#
# print(0 in a)

# 4

# a = {23, 344,6546,4}
# a.discard(32)      # Не выдаст ошибку при удаления элемента которого нет в множестве
# print(a)
# a.remove(0)         # Выдаст ошибку при удаления элемента которого нет в множестве
# print(a)
# x = a.pop()         # удаления элемента
# print(a, x)

# 5

# a = {1, 2, 3, 4, 5, 6}
# b = {7, 8, 9, 10, 1, 2, 3, 4, 5}
# d = {11,33,44,55,4,5,6}
# # c = a.union(b)          # Объединения множеств
# # print(c)
# o = a.union(b,d)          # Объединения нескольких множеств
# print(o)

# print(a | b | d)            # Объединения нескольких множеств

# 6

# a = {1, 2, 3}
# b = {4,3,6}
# print(a & b)          # Значения которые пересекаются
# print(a - b)            # Отнимает с 1 переменной элементы которые находяться во второй
# print(b - a)

# 7

# s = {'adsasd','sdasd','dasd'}
# x = s.copy()                         # Копирование
# print(x)

# 8
# a = {1, 2, 3, 4, 5, 6}
# b = {7, 8, 9, 10, 1, 2, 3, 4, 5}
# x = a.isdisjoint(b)                 # Проверяет является ли множество пересечением, если множество не содержит общих элементов, то True, иначе False
# print(x)

# 9
# my_set = frozenset([1,2,3,-10,40])      # Делает множество неизменяемым типом данных
# print(type(my_set))

# 10

# a = {1, 2, 3}
# a.add('fddf')        # Добавление во множество
# a.add(34)
# print(a)

# 11    Проверить, есть ли в последовательности списка дубликаты

# a = [1,3,2,4,4,4]
# b = set(a)
# if len(a) == len(b):
#     print('Дубликатов нет')
# else:
#     print('Дубликаты есть')

# 12
# a = {1, 2, 3,'As', 4, 5, 6}
# b = frozenset({1, 55, 88, 33,'As', 5, 4, 6})
# print(a | b)
# print(a & b)
